# Taps
tap "homebrew/cask-fonts"

# Brews
brew "asdf"
brew "chezmoi"
brew "coreutils"
brew "curl" 
brew "direnv"
brew "discord"
brew "gawk"
brew "gh"
brew "git-gui"
brew "git"
brew "git"
brew "gnupg"
brew "google-chrome"
brew "gpg"
brew "mas"
brew "pnpm"
brew "spaceship"
brew "starship"
brew "vim"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"

# Casks
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "bluesnooze"
cask "brave-browser"
cask "ccleaner"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "insomnia"
cask "itsycal"
cask "karabiner-elements"
cask "macmediakeyforwarder"
cask "meld"
cask "monitorcontrol"
cask "notion"
cask "postman"
cask "scroll-reverser"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"

# App store
mas "Owly", id: 882812218
mas "Xcode", id: 497799835
